In [1]:
import pandas as pd

In [4]:
x = pd.read_excel("C:/Users/acer/OneDrive/Documents/junglebook.xlsx")
x.iloc[1,1]=600
print(x)

     name class  grade  rollno
0    sonu      A     b       1
1  rakesh    600     b       2
2    dani      C     a       3
3  mukesh      D     a       4
4  lokesh      E     c       5

In [5]:
a= pd.read_excel("C:/Users/acer/OneDrive/Documents/junglebook.xlsx",sheet_name="Sheet1")
a

     name class  grade  rollno
0    sonu      A     b       1
1  rakesh      B     b       2
2    dani      C     a       3
3  mukesh      D     a       4
4  lokesh      E     c       5

In [6]:
b  = pd.read_excel("C:/Users/acer/OneDrive/Documents/junglebook.xlsx",sheet_name ="Sheet2")
b

   Unnamed: 0 Unnamed: 1 Unnamed: 2
0         NaN     fruits     rupees
1         NaN      mango        150
2         NaN     litchi         60
3         NaN     banana         60
4         NaN     papaya         70

In [9]:
c  = pd.read_excel("C:/Users/acer/OneDrive/Documents/junglebook.xlsx",sheet_name ="Sheet3")
c

   Unnamed: 0 Unnamed: 1
0    expenses         rs
1        rent       6000
2    electric       2000
3       water        500
4        food       6000
5  other mis.       2000

In [23]:
x = pd.read_excel("C:/Users/acer/OneDrive/Documents/junglebook.xlsx")
with pd.ExcelWriter("alone.xlsx")as writer:
    x = pd.DataFrame({"name":["kajal","koyal","kiran"],"marks":[78,79,69]},index = [1,2,3])
    x.to_excel(writer,sheet_name ="Sheet1")
    x = pd.DataFrame({"fruits":["mango","apple","banana"],"marks":[78,79,69]},index = ["a","b","c"])
    x.to_excel(writer,sheet_name ="Sheet2")
    x = pd.DataFrame({"vegetable":["potato","tomato","peas"],"marks":[78,79,69]},index = ["A","B","C"])
    x.to_excel(writer,sheet_name ="Sheet3")
    print(x)

  vegetable  marks
A    potato     78
B    tomato     79
C      peas     69

In [20]:
with pd.ExcelWriter("alone.xlsx")as writer:
   
    x = pd.DataFrame({"fruits":["mango","apple","banana"],"marks":[78,79,69]},index = ["a","b","c"])
    x.iloc[0,1]=9000
    x.to_excel(writer,sheet_name ="Sheet2")
    
    print(x)

   fruits  marks
a   mango   9000
b   apple     79
c  banana     69

In [18]:
with pd.ExcelWriter("alone.xlsx")as writer:
    x = pd.DataFrame({"name":["kajal","koyal","kiran"],"marks":[78,79,69]},index = [1,2,3])
    x.iloc[0,1]=33
    x.to_excel(writer,sheet_name ="Sheet1")
    print(x)

    name  marks
1  kajal     33
2  koyal     79
3  kiran     69

In [32]:
with pd.ExcelWriter("cocacola.xlsx")as writer:
    a = pd.DataFrame({"movie":["pk","3 idiot","golmaal"],"rate":[8,9,5]},index = [1,2,3])
    a.to_excel(writer,sheet_name ="Sheet1")
    b = pd.DataFrame({"fruits":["mango","apple","banana"],"marks":[78,79,69]},index = ["a","b","c"])
    b.to_excel(writer,sheet_name ="Sheet2")
    c = pd.DataFrame({"vegetable":["potato","tomato","peas"],"marks":[78,79,69]},index = ["A","B","C"])
    c.to_excel(writer,sheet_name ="Sheet3")
    d = pd.DataFrame({"Game":["gta","downhill","motal combate"],"marks":[78,79,69]},index = ["A","B","C"])
    d.to_excel(writer,sheet_name ="Sheet4")
    print(a)
    print(b)
    print(c)
    print(d)

     movie  rate
1       pk     8
2  3 idiot     9
3  golmaal     5
   fruits  marks
a   mango     78
b   apple     79
c  banana     69
  vegetable  marks
A    potato     78
B    tomato     79
C      peas     69
            Game  marks
A            gta     78
B       downhill     79
C  motal combate     69